{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "b9ddd5b7-5b5f-470e-bbf6-d512a5bbcaf7",
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Dict\n",
    "from collections import defaultdict\n",
    "import json\n",
    "import os\n",
    "from pprint import pprint\n",
    "\n",
    "from py2neo import GraphService, Graph, Node, Relationship, Subgraph\n",
    "\n",
    "import graph_builder as gb\n",
    "\n",
    "%load_ext autoreload\n",
    "%autoreload 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "cd741538-2022-482f-b7d6-67795eb4881e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# G = Graph(\"bolt://localhost:7687\")\n",
    "username = \"neo4j\"\n",
    "password = \"KrRsKLC26qhHSdj4PG_qRso98GdyDbZOTQrdvvZPr8Q\"\n",
    "G = Graph(f\"neo4j+s://{username}:{password}@f2c1d80b.databases.neo4j.io\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "bb7231e3-0505-4c0a-93a3-be4dc329408c",
   "metadata": {},
   "outputs": [],
   "source": [
    "G.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "a1ef22cc-d7f0-4da3-bbb1-ad8dab5e8e0d",
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"data/scraped/classes.json\") as f:\n",
    "    classes = json.load(f)\n",
    "    \n",
    "with open(\"data/scraped/programs.json\") as f:\n",
    "    programs = json.load(f)\n",
    "    \n",
    "with open(\"data/scraped/specialisations.json\") as f:\n",
    "    special = json.load(f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "7b5a28f3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3431 313 446\n"
     ]
    }
   ],
   "source": [
    "print(len(classes), len(programs), len(special))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "49110e6c-6751-4430-be83-c73d2f8c544a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# G.schema.create_uniqueness_constraint('class', 'id')\n",
    "# G.schema.create_uniqueness_constraint('program', 'id')\n",
    "# G.schema.create_uniqueness_constraint('specialisation', 'id')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "64d49e4a-3c8d-4614-839b-09ab7629d88e",
   "metadata": {},
   "source": [
    "## Create Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "0b878d5a-abe6-4fbe-b6ed-77a919ef6cf4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>count(*)</th></tr><tr><td style=\"text-align:right\">0</td></tr></table>"
      ],
      "text/plain": [
       " count(*) \n",
       "----------\n",
       "        0 "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "G.run(\"\"\"\n",
    "MATCH (n)\n",
    "RETURN count(*)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cf1ec84e-a1a7-420d-ac85-8863c8fa44a4",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "for doc in classes:\n",
    "    gb.create_node_if_not_exists(gb.CLASSES, doc, G, doc['id'], 'class')\n",
    "print(len(gb.CLASSES))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1af212a0-79b8-4e45-a5cc-64eb917792b8",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "for doc in programs:\n",
    "    gb.create_node_if_not_exists(gb.PROGRAMS, doc, G, doc['id'], 'program')\n",
    "print(len(gb.PROGRAMS))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c9ca73ac-f641-4aa2-bd7e-3b67a601956f",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "for doc in special:\n",
    "    gb.create_node_if_not_exists(gb.SPECIAL, doc, G, doc['id'], 'specialisation')\n",
    "print(len(gb.SPECIAL))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d14024d3",
   "metadata": {},
   "outputs": [],
   "source": [
    "G.run(\"\"\"\n",
    "MATCH (n)\n",
    "RETURN count(*)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b8eafdbc-47c1-413d-a8fb-e94ad65d57df",
   "metadata": {},
   "source": [
    "## Create Edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e0f1e99e-f434-438c-8a34-23670eae06f6",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "## create edges for class requisites\n",
    "for doc in classes:\n",
    "    if 'requisites' in doc:\n",
    "        gb.create_nodes_and_edges_if_class_requisite(doc['requisites'], gb.CLASSES[doc['id']], G)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "70e5464b-ce64-41a8-bdd5-5656da31f3da",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "for doc in programs:\n",
    "    src_node = gb.PROGRAMS[doc['id']]\n",
    "    for requirement in doc['requirements']:\n",
    "        gb.create_nodes_and_edges_if_program(requirement, src_node, G)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e0df683a-2e78-45cb-a00a-67b47623b38a",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "for doc in special:\n",
    "    src_node = gb.SPECIAL[doc['id']]\n",
    "    for requirement in doc['requirements']:\n",
    "        gb.create_nodes_and_edges_if_program(requirement, src_node, G)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ba78971-b3cf-4b9f-a6b9-83c4cec90a0f",
   "metadata": {},
   "outputs": [],
   "source": [
    "G.run(\"\"\"\n",
    "MATCH (n)-[]-()\n",
    "RETURN count(*)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ab680547-3c5c-489f-8ea7-574a2fd2947e",
   "metadata": {},
   "source": [
    "## Check"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "219fa88c-531f-45f1-9f9d-8437b5f67ae2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gb.COUNTER"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "249fc72e-cf64-40c3-9246-cecfc6640dd7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(gb.UNMERGED_EDGES)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "5d8b0053-89eb-4fc2-939e-a8a6f728e03a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "27142"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(gb.MERGED_EDGES)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "3def4526-5724-4f97-b852-24377250110f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "153"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(gb.NOT_FOUND)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "5e8b4bda-1cce-4f7b-a0be-9af138c339c5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'name': 'AnthropologyArchaeologyArt History and TheoryAsia-Pacific StudiesAustralian Indigenous StudiesBiological AnthropologyClassical StudiesContemporary EuropeCriminologyDevelopment StudiesDigital HumanitiesEconomicsEnglishEnvironmental StudiesGender, Sexuality, and CultureHistoryInternational RelationsLanguage StudiesMathematicsMiddle Eastern and Central Asian StudiesMusicPhilosophyPolitical SciencePsychologySecurity StudiesSociology',\n",
       "  'type': 'SPC'},\n",
       " {'type': 'MAJ',\n",
       "  'name': 'The following Bachelor of Arts (Honours) specialisation(s) are available, subject to meeting the entry requirements, to each Bachelor of Arts major.'},\n",
       " {'type': 'MAJ', 'name': 'BA Major Honours Specialisation(s)'},\n",
       " {'name': 'Asia-Pacific Studies', 'type': 'SPC'},\n",
       " {'name': 'Classical Studies', 'type': 'SPC'},\n",
       " {'name': 'Economics', 'type': 'SPC'},\n",
       " {'name': 'Gender, Sexuality, and Culture', 'type': 'SPC'},\n",
       " {'name': 'Language Studies', 'type': 'SPC'},\n",
       " {'name': 'Security Studies', 'type': 'SPC'},\n",
       " {'type': 'MAJ', 'name': 'MAJORS'},\n",
       " {'name': 'Disciplines and Fields', 'type': 'MAJ'},\n",
       " {'name': 'Languages', 'type': 'MAJ'},\n",
       " {'name': 'Geographically Defined Area Studies', 'type': 'MAJ'},\n",
       " {'name': 'Asia and Pacific Culture, Media and Gender', 'type': 'MAJ'},\n",
       " {'type': 'MIN', 'name': 'MINORS'},\n",
       " {'name': 'Disciplines and Fields', 'type': 'MIN'},\n",
       " {'name': 'Languages', 'type': 'MIN'},\n",
       " {'name': 'Geographically Defined Area Studies', 'type': 'MIN'},\n",
       " {'name': 'Asia and Pacific Archaeology', 'type': 'MIN'},\n",
       " {'name': 'Asia and Pacific Culture, Media and Gender', 'type': 'MIN'},\n",
       " {'name': 'Asia and Pacific Literature and Film', 'type': 'MIN'},\n",
       " {'name': 'ANIP', 'type': 'MIN'},\n",
       " {'name': 'Earth and Marine Science', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Physics of the Earth', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'name': 'Languages', 'type': 'MIN'},\n",
       " {'name': 'Portuguese Language', 'type': 'MIN'},\n",
       " {'name': 'TibetanLanguage', 'type': 'MIN'},\n",
       " {'name': 'Disciplines', 'type': 'MIN'},\n",
       " {'name': 'Area Studies', 'type': 'MIN'},\n",
       " {'name': 'Aerospace Systems', 'type': 'MAJ'},\n",
       " {'name': 'Aerospace Systems', 'type': 'MAJ'},\n",
       " {'name': 'Earth and Marine Science', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Physics of the Earth', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'name': 'Climate Change Science and Policy', 'type': 'MIN'},\n",
       " {'name': 'Earth and Marine Science', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Physics of the Earth', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'type': 'SPC',\n",
       "  'name': 'For students undertaking Honours in an Honours specialisation other than , the Honours research project must be in the field of Environment & Sustainability.'},\n",
       " {'name': 'Earth and Marine Science', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Physics of the Earth', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'name': 'Finance Honours ;OR', 'type': 'SPC'},\n",
       " {'name': 'Statistics Honours ;OR', 'type': 'SPC'},\n",
       " {'name': 'Earth and Marine Science', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Physics of the Earth', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'name': 'Health and Medicine', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'type': 'MAJ',\n",
       "  'name': 'INFS Information Systems, only if completing the Information Systems'},\n",
       " {'type': 'MAJ',\n",
       "  'name': 'INFS Information Systems, only if completing the Information Systems'},\n",
       " {'name': 'Earth and Marine Science', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Physics of the Earth', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'name': 'Language', 'type': 'MIN'},\n",
       " {'name': 'Arabic Language', 'type': 'MIN'},\n",
       " {'name': 'Area Studies and Methods', 'type': 'MIN'},\n",
       " {'name': 'Security', 'type': 'MIN'},\n",
       " {'name': 'Earth and Marine Science', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Physics of the Earth', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'name': 'Languages spoken in the Pacific or of historical and community importance:',\n",
       "  'type': 'MIN'},\n",
       " {'type': 'MIN',\n",
       "  'name': 'Disciplinary and regional studies minors of relevance to the study of the Pacific Islands:'},\n",
       " {'name': 'Biodiversity and Conservation Management', 'type': 'MIN'},\n",
       " {'name': 'Comparative Politics', 'type': 'MIN'},\n",
       " {'type': 'MIN',\n",
       "  'name': 'an in-country study abroad component/exchange in the same language as the'},\n",
       " {'type': 'MIN',\n",
       "  'name': 'an internship undertaken in the same language as the'},\n",
       " {'type': 'MIN', 'name': 'Russian and Central Asian'},\n",
       " {'name': 'Earth and Marine Science', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Physics of the Earth', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'name': 'Social Science', 'type': 'MIN'},\n",
       " {'type': 'MAJ', 'name': 'Security Studies'},\n",
       " {'name': 'Humanities', 'type': 'MIN'},\n",
       " {'type': 'MAJ', 'name': 'Asian and Pacific Culture, Media, and Gender'},\n",
       " {'name': 'Area Studies', 'type': 'MIN'},\n",
       " {'name': 'Languages', 'type': 'MIN'},\n",
       " {'type': 'SPC', 'name': 'Economic Studies Honours'},\n",
       " {'type': 'SPC', 'name': 'European Studies Honours'},\n",
       " {'name': 'Agricultural Innovation', 'type': 'MAJ'},\n",
       " {'type': 'MIN', 'name': 'Earth and Marine Science'},\n",
       " {'name': 'Earth and Marine Science', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Medical Research', 'type': 'SPC'},\n",
       " {'name': 'Physics of the Earth', 'type': 'SPC'},\n",
       " {'name': 'Population Health', 'type': 'SPC'},\n",
       " {'name': 'Science', 'type': 'SPC'},\n",
       " {'type': 'MIN', 'name': 'Earth and Marine Science'},\n",
       " {'type': 'MIN', 'name': 'Integrative Methods in Environment and Society'},\n",
       " {'name': 'Development', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Indigenous', 'type': 'SPC'},\n",
       " {'name': 'Fieldwork and Internship courses', 'type': 'SPC'},\n",
       " {'name': 'Development', 'type': 'SPC'},\n",
       " {'name': 'Environment', 'type': 'SPC'},\n",
       " {'name': 'Indigenous', 'type': 'SPC'},\n",
       " {'name': 'Fieldwork and Internship courses', 'type': 'SPC'},\n",
       " {'name': 'Literary Chinese Language', 'type': 'MIN'},\n",
       " {'name': 'Tok Pisin', 'type': 'MIN'},\n",
       " {'name': 'Tibetan Language', 'type': 'MIN'},\n",
       " {'name': 'Ancient Greek Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Arabic Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Australian Indigenous Languages and Society', 'type': 'SPC'},\n",
       " {'name': 'Burmese Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Chinese Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Hindi Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Indonesian Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Japanese Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Korean Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Latin Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Mongolian Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Persian Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Portuguese Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Russian Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Sanskrit Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Spanish Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Tetum Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Thai Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Tok Pisin Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Vietnamese Language and Culture', 'type': 'SPC'},\n",
       " {'name': 'Entrepreneurship & Innovation', 'type': 'SPC'},\n",
       " {'name': 'Entrepreneurship & Innovation', 'type': 'SPC'},\n",
       " {'name': 'Students who do not achieve a minimum 70% Weighted Average Mark or do not have the approval of an identified supervisor will be transferred to Master of Neuroscience or the Graduate Diploma of Science.',\n",
       "  'type': 'MAJ'},\n",
       " {'type': 'MAJ',\n",
       "  'name': 'A research project, internship, fieldwork or special topic course with an Indigenous science focus approved by the Indigenous Science and Knowledges Major convenor'},\n",
       " {'name': 'A minimum of 6 from completion of courses from the following list:',\n",
       "  'type': 'SPC'},\n",
       " {'name': 'OR', 'type': 'MIN'}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gb.NOT_FOUND"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "8f50f8a6-2a3c-40e2-b6c0-809e3e47e40a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# for item in sorted(ALL_PROGRAMS.keys()):\n",
    "#     if '(' in item:\n",
    "#         print(item)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "520ab72a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# ret = G.nodes.match('program', name='Master of Computing')\n",
    "# ret"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "1efd017c-48f3-4424-a9d0-746f4ae736c2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# node = ret.first()\n",
    "# node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "1cace25b-2858-4c88-a6b5-983a94e68c2e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# ret = G.relationships.match([node])\n",
    "# list(ret)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "8b7a27b1-e772-46d6-ab9b-d5246c819c9f",
   "metadata": {},
   "outputs": [],
   "source": [
    "# edges = []\n",
    "# for edge in ret:\n",
    "#     edges.extend(list(G.relationships.match([edge.end_node])))\n",
    "# edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "7141dd47-3c74-4d13-97c3-6405313db93c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# items = []\n",
    "# for edge in edges:\n",
    "#     items.extend(list(G.relationships.match([edge.start_node])))\n",
    "# items"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ee336cb8-9823-4d39-9036-80ecf0019abb",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
